app/controllers/seats_controller.rb

  def show
    @seat = Seat.find(params[:id])
---
SELECT * FROM "seats" WHERE ("seats"."id" = 1)

  def create
    @seat = Seat.new(params[:seat])
    @seat.save
---
INSERT INTO "seats" ("name", "flight_id", "created_at", "baggage", "updated_at") VALUES('evelyn', 4, '2010-10-04 17:33:37', 2.0, '2010-10-04 17:33:37')

  def destroy
    @seat = Seat.find(params[:id])
    @seat.destroy
---
SELECT * FROM "seats" WHERE ("seats"."id" = 5)
DELETE FROM "seats" WHERE "id" = 5

  def flight_seats
    @flight = Flight.find(params[:flight_id])
---
SELECT * FROM "flights" WHERE ("flights"."id" = 4)